mactkg/Arduino/boards.txt
phoenix_v1.menu.ResetMethod.nodemcu=nodemcu
phoenix_v1.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu
phoenix_v1.menu.ResetMethod.ck=ck
phoenix_v1.menu.ResetMethod.ck.upload.resetmethod=ck

phoenix_v1.menu.Debug.Disabled=Disabled
phoenix_v1.menu.Debug.Disabled.build.debug_port=
phoenix_v1.menu.Debug.Serial=Serial
phoenix_v1.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
phoenix_v1.menu.Debug.Serial1=Serial1
phoenix_v1.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1

phoenix_v1.menu.DebugLevel.None____=None
phoenix_v1.menu.DebugLevel.None____.build.debug_level=
phoenix_v1.menu.DebugLevel.Core____=Core
phoenix_v1.menu.DebugLevel.Core____.build.debug_level=-DDEBUG_ESP_CORE
phoenix_v1.menu.DebugLevel.SSL_____=Core + SSL
phoenix_v1.menu.DebugLevel.SSL_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL
phoenix_v1.menu.DebugLevel.SSL_MEM_=Core + SSL + TLS Mem
phoenix_v1.menu.DebugLevel.SSL_MEM_.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_TLS_MEM
phoenix_v1.menu.DebugLevel.WiFic___=Core + WiFi
phoenix_v1.menu.DebugLevel.WiFic___.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI
phoenix_v1.menu.DebugLevel.WiFi____=WiFi
phoenix_v1.menu.DebugLevel.WiFi____.build.debug_level=-DDEBUG_ESP_WIFI
phoenix_v1.menu.DebugLevel.HTTPClient=HTTPClient
phoenix_v1.menu.DebugLevel.HTTPClient.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT
phoenix_v1.menu.DebugLevel.HTTPClient2=HTTPClient + SSL
phoenix_v1.menu.DebugLevel.HTTPClient2.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_SSL
phoenix_v1.menu.DebugLevel.HTTPUpdate=HTTPUpdate
phoenix_v1.menu.DebugLevel.HTTPUpdate.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE
phoenix_v1.menu.DebugLevel.HTTPUpdate2=HTTPClient + HTTPUpdate
phoenix_v1.menu.DebugLevel.HTTPUpdate2.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE
phoenix_v1.menu.DebugLevel.HTTPUpdate3=HTTPClient + HTTPUpdate + Updater
phoenix_v1.menu.DebugLevel.HTTPUpdate3.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER
phoenix_v1.menu.DebugLevel.HTTPServer=HTTPServer
phoenix_v1.menu.DebugLevel.HTTPServer.build.debug_level=-DDEBUG_ESP_HTTP_SERVER
phoenix_v1.menu.DebugLevel.UPDATER=Updater
phoenix_v1.menu.DebugLevel.UPDATER.build.debug_level=-DDEBUG_ESP_UPDATER
phoenix_v1.menu.DebugLevel.OTA_____=OTA
phoenix_v1.menu.DebugLevel.OTA_____.build.debug_level=-DDEBUG_ESP_OTA
phoenix_v1.menu.DebugLevel.OTA2____=OTA + Updater
phoenix_v1.menu.DebugLevel.OTA2____.build.debug_level=-DDEBUG_ESP_OTA -DDEBUG_ESP_UPDATER
phoenix_v1.menu.DebugLevel.all_____=All
phoenix_v1.menu.DebugLevel.all_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_TLS_MEM

phoenix_v1.build.debug_port=
phoenix_v1.build.debug_level=

##############################################################
phoenix_v2.name=Phoenix 2.0
phoenix_v2.upload.tool=esptool
phoenix_v2.upload.speed=115200
phoenix_v2.upload.maximum_size=1044464
phoenix_v2.upload.maximum_data_size=81920
phoenix_v2.upload.wait_for_upload_port=true

phoenix_v2.build.mcu=esp8266
phoenix_v2.build.f_cpu=80000000L
phoenix_v2.build.board=ESP8266_PHOENIX_V2
phoenix_v2.build.core=esp8266
phoenix_v2.build.variant=phoenix_v2
phoenix_v2.build.flash_mode=dio
phoenix_v2.build.flash_size=4M
phoenix_v2.build.flash_freq=40

phoenix_v2.menu.CpuFrequency.80=80 MHz
phoenix_v2.menu.CpuFrequency.80.build.f_cpu=80000000L
phoenix_v2.menu.CpuFrequency.160=160 MHz
phoenix_v2.menu.CpuFrequency.160.build.f_cpu=160000000L

phoenix_v2.menu.UploadSpeed.115200=115200
phoenix_v2.menu.UploadSpeed.115200.upload.speed=115200
phoenix_v2.menu.UploadSpeed.57600=57600
phoenix_v2.menu.UploadSpeed.57600.upload.speed=57600
phoenix_v2.menu.UploadSpeed.256000.windows=256000
phoenix_v2.menu.UploadSpeed.256000.upload.speed=256000
phoenix_v2.menu.UploadSpeed.230400.linux=230400
phoenix_v2.menu.UploadSpeed.230400.macosx=230400
phoenix_v2.menu.UploadSpeed.230400.macosx=230400
phoenix_v2.menu.UploadSpeed.230400.upload.speed=230400
phoenix_v2.menu.UploadSpeed.460800.linux=460800
phoenix_v2.menu.UploadSpeed.460800.macosx=460800
phoenix_v2.menu.UploadSpeed.460800.upload.speed=460800
phoenix_v2.menu.UploadSpeed.512000.windows=512000
phoenix_v2.menu.UploadSpeed.512000.upload.speed=512000
phoenix_v2.menu.UploadSpeed.921600=921600
phoenix_v2.menu.UploadSpeed.921600.upload.speed=921600

phoenix_v2.menu.FlashSize.4M3M=4M (3M SPIFFS)
phoenix_v2.menu.FlashSize.4M3M.build.flash_size=4M
phoenix_v2.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
phoenix_v2.menu.FlashSize.4M3M.build.spiffs_start=0x100000
phoenix_v2.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
phoenix_v2.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
phoenix_v2.menu.FlashSize.4M3M.upload.maximum_size=1044464

phoenix_v2.menu.FlashSize.4M1M=4M (1M SPIFFS)
phoenix_v2.menu.FlashSize.4M1M.build.flash_size=4M
phoenix_v2.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
phoenix_v2.menu.FlashSize.4M1M.build.spiffs_start=0x300000
phoenix_v2.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
phoenix_v2.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
phoenix_v2.menu.FlashSize.4M1M.build.spiffs_pagesize=256
phoenix_v2.menu.FlashSize.4M1M.upload.maximum_size=1044464

phoenix_v2.menu.ResetMethod.ck=ck
phoenix_v2.menu.ResetMethod.ck.upload.resetmethod=ck
phoenix_v2.menu.ResetMethod.nodemcu=nodemcu
phoenix_v2.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu

phoenix_v2.menu.Debug.Disabled=Disabled
phoenix_v2.menu.Debug.Disabled.build.debug_port=
phoenix_v2.menu.Debug.Serial=Serial
phoenix_v2.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
phoenix_v2.menu.Debug.Serial1=Serial1
phoenix_v2.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1

phoenix_v2.menu.DebugLevel.None____=None
phoenix_v2.menu.DebugLevel.None____.build.debug_level=
phoenix_v2.menu.DebugLevel.Core____=Core
phoenix_v2.menu.DebugLevel.Core____.build.debug_level=-DDEBUG_ESP_CORE
phoenix_v2.menu.DebugLevel.SSL_____=Core + SSL
phoenix_v2.menu.DebugLevel.SSL_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL
phoenix_v2.menu.DebugLevel.SSL_MEM_=Core + SSL + TLS Mem
phoenix_v2.menu.DebugLevel.SSL_MEM_.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_TLS_MEM
phoenix_v2.menu.DebugLevel.WiFic___=Core + WiFi
phoenix_v2.menu.DebugLevel.WiFic___.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI
phoenix_v2.menu.DebugLevel.WiFi____=WiFi
phoenix_v2.menu.DebugLevel.WiFi____.build.debug_level=-DDEBUG_ESP_WIFI
phoenix_v2.menu.DebugLevel.HTTPClient=HTTPClient
phoenix_v2.menu.DebugLevel.HTTPClient.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT
phoenix_v2.menu.DebugLevel.HTTPClient2=HTTPClient + SSL
phoenix_v2.menu.DebugLevel.HTTPClient2.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_SSL
phoenix_v2.menu.DebugLevel.HTTPUpdate=HTTPUpdate
phoenix_v2.menu.DebugLevel.HTTPUpdate.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE
phoenix_v2.menu.DebugLevel.HTTPUpdate2=HTTPClient + HTTPUpdate
phoenix_v2.menu.DebugLevel.HTTPUpdate2.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE
phoenix_v2.menu.DebugLevel.HTTPUpdate3=HTTPClient + HTTPUpdate + Updater
phoenix_v2.menu.DebugLevel.HTTPUpdate3.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER
phoenix_v2.menu.DebugLevel.HTTPServer=HTTPServer
phoenix_v2.menu.DebugLevel.HTTPServer.build.debug_level=-DDEBUG_ESP_HTTP_SERVER
phoenix_v2.menu.DebugLevel.UPDATER=Updater
phoenix_v2.menu.DebugLevel.UPDATER.build.debug_level=-DDEBUG_ESP_UPDATER
phoenix_v2.menu.DebugLevel.OTA_____=OTA
phoenix_v2.menu.DebugLevel.OTA_____.build.debug_level=-DDEBUG_ESP_OTA
phoenix_v2.menu.DebugLevel.OTA2____=OTA + Updater
phoenix_v2.menu.DebugLevel.OTA2____.build.debug_level=-DDEBUG_ESP_OTA -DDEBUG_ESP_UPDATER
phoenix_v2.menu.DebugLevel.all_____=All
phoenix_v2.menu.DebugLevel.all_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_TLS_MEM

